Autodesk.Revit.DB.Structure.RebarHookOrientation
Orientation of a rebar hook relative to the path of the Rebar Shape.

Autodesk.Revit.DB.Structure.RebarHookOrientation.Right
Hook towards the right of a segment-based shape (RebarShapeDefinitionBySegments), or to the
exterior of an arc-based shape (RebarShapeDefinitionByArc).

Autodesk.Revit.DB.Structure.RebarHookOrientation.Left
Hook towards the left of a segment-based shape (RebarShapeDefinitionBySegments), or to the
interior of an arc-based shape (RebarShapeDefinitionByArc).